mydata<-read.csv("C:/test/대한석탄공사_국내연탄용석탄소비현황(2007-2019).csv")
#print(mydata)

data<-c(270, 19, 286, 70, 35,	27,	19,	32,	108,	348,	398,	304,
         323,	294,	413,	51,	30,	43,	38,	56,	127,	269,	340,	305,
         248,	191,	178,	105,	55,	47,	27,	45,	157,	322,	299,	268,
         235,	167,	160,	126,	64,	46,	43,	61,	114,	300,	311,	232,
         255,	143,	152,	87,	52,	33,	19,	45,	162,	314,	280,	280,
         205,	194,	139,	79,	37,	29,	17,	30,	123,	315,	374,	291,
         268,	171,	117,	92,	46,	27,	51,	51,	140,	310,	363,	281,
         202,	142,	104,	54,	35,	22,	18,	36,	136,	263,	319,	299,
         197,	139,	109,	58,	25,	21,	15,	27,	102,	251,	275,	254,
         170,	126,	90,	39,	24,	21,	14,	36,	93,	195,	253,	194,
         127,	113,	78,	36,	18,	14,	7,	18,	105,	167,	247,	149,
         119,	98,	60,	34,	20,	14,	11,	16,	65,	177,	173,	126,
         96,	57,	39,	28,	13,	8,	7,	12,	50,	107,	136,	91)

#수평 패턴 시계열 
data1<-ts(data = data, start=c(2007,1), frequency = 12)
#print(data1)
#plot(data1, ylime=range(400))

#평균이 달라지는 시계열
data2<-c(270, 19, 286, 70, 35,	27,	19,	32,	108,	348,	398,	304,
         323,	294,	413,	51,	30,	43,	38,	56,	127,	269,	340,	305)
data2<-ts(data=data2, start=c(2007,1), frequency = 12)
#print(data2)
#plot(data2,ylime=range(400))

#추세 패턴 시계열
data3<-c(19,	45,	162,	314,	280,	280)
data3<-ts(data=data3, start=c(2011,7), frequency = 12)
#print(data3)
#plot(data3,ylime=range(400))

#계절 패턴 시계열
data4<-c(127,	113,	78,	36,	18,	14,	7,	18,	105,	167,	247,	149)
data4<-ts(data=data4, start=c(2017,1), frequency = 12)
#print(data4)
#plot(data4, ylime=range(300))

#추세와 계절 패턴 시계열
data5<-c(170,	126,	90,	39,	24,	21,	14,	36,	93,	195,	253,	194,
         127,	113,	78,	36,	18,	14,	7,	18,	105,	167,	247,	149,
         119,	98,	60,	34,	20,	14,	11,	16,	65,	177,	173,	126,
         96,	57,	39,	28,	13,	8,	7,	12,	50,	107,	136,	91)
data5<-ts(data=data5, start=c(2016,1), frequency = 12)
#print(data5)
#plot(data5, ylime=range(300))



#
library(forecast)
data8<-c(268,	171,	117,	92,	46,	27,	51,	51,	140,	310,	363,	281,
         202,	142,	104,	54,	35,	22,	18,	36,	136,	263,	319,	299,
         197,	139,	109,	58,	25,	21,	15,	27,	102,	251,	275,	254,
         170,	126,	90,	39,	24,	21,	14,	36,	93,	195,	253,	194,
         127,	113,	78,	36,	18,	14,	7,	18,	105,	167,	247,	149,
         119,	98,	60,	34,	20,	14,	11,	16,	65,	177,	173,	126,
         96,	57,	39,	28,	13,	8,	7,	12,	50,	107,	136,	91)
data8<-ts(data = data8, start=c(2013,1), frequency = 12)

Holt5<-HoltWinters(data8)
#print(fitted(Holt5))
#print(residuals(Holt5))
#print(forecast(Holt5))
#plot(Holt5)

ets1<-ets(data8, model="AAA")
#print(fitted(ets1))
#print(residuals(ets1))
#print(accuracy(ets1))
#print(forecast(ets1, h=8))
#summary(ets1)
#plot(ets1)

plot(data8, xlim=range(2013.1,2021.5), ylim=range(0,400))
par(new=TRUE)
plot(hol, type="b", xlim=range(2013.1,2021.5), ylim=range(0,400))